Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEvadc_reg.h
/** \brief 1AA0, Group 5 Result Control Register 8 */
#define EVADC_G5_RCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021AA0u)
/** Alias (User Manual Name) for EVADC_G5_RCR8.
* To use register names with standard convension, please use EVADC_G5_RCR8.
*/
#define EVADC_G5RCR8 (EVADC_G5_RCR8)

/** \brief 1AA4, Group 5 Result Control Register 9 */
#define EVADC_G5_RCR9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021AA4u)
/** Alias (User Manual Name) for EVADC_G5_RCR9.
* To use register names with standard convension, please use EVADC_G5_RCR9.
*/
#define EVADC_G5RCR9 (EVADC_G5_RCR9)

/** \brief 1AA8, Group 5 Result Control Register 10 */
#define EVADC_G5_RCR10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021AA8u)
/** Alias (User Manual Name) for EVADC_G5_RCR10.
* To use register names with standard convension, please use EVADC_G5_RCR10.
*/
#define EVADC_G5RCR10 (EVADC_G5_RCR10)

/** \brief 1AAC, Group 5 Result Control Register 11 */
#define EVADC_G5_RCR11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021AACu)
/** Alias (User Manual Name) for EVADC_G5_RCR11.
* To use register names with standard convension, please use EVADC_G5_RCR11.
*/
#define EVADC_G5RCR11 (EVADC_G5_RCR11)

/** \brief 1AB0, Group 5 Result Control Register 12 */
#define EVADC_G5_RCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021AB0u)
/** Alias (User Manual Name) for EVADC_G5_RCR12.
* To use register names with standard convension, please use EVADC_G5_RCR12.
*/
#define EVADC_G5RCR12 (EVADC_G5_RCR12)

/** \brief 1AB4, Group 5 Result Control Register 13 */
#define EVADC_G5_RCR13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021AB4u)
/** Alias (User Manual Name) for EVADC_G5_RCR13.
* To use register names with standard convension, please use EVADC_G5_RCR13.
*/
#define EVADC_G5RCR13 (EVADC_G5_RCR13)

/** \brief 1AB8, Group 5 Result Control Register 14 */
#define EVADC_G5_RCR14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021AB8u)
/** Alias (User Manual Name) for EVADC_G5_RCR14.
* To use register names with standard convension, please use EVADC_G5_RCR14.
*/
#define EVADC_G5RCR14 (EVADC_G5_RCR14)

/** \brief 1ABC, Group 5 Result Control Register 15 */
#define EVADC_G5_RCR15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF0021ABCu)
/** Alias (User Manual Name) for EVADC_G5_RCR15.
* To use register names with standard convension, please use EVADC_G5_RCR15.
*/
#define EVADC_G5RCR15 (EVADC_G5_RCR15)

/** \brief 1B00, Group 5 Result Register 0\n */
#define EVADC_G5_RES0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B00u)
/** Alias (User Manual Name) for EVADC_G5_RES0.
* To use register names with standard convension, please use EVADC_G5_RES0.
*/
#define EVADC_G5RES0 (EVADC_G5_RES0)

/** \brief 1B04, Group 5 Result Register 1\n */
#define EVADC_G5_RES1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B04u)
/** Alias (User Manual Name) for EVADC_G5_RES1.
* To use register names with standard convension, please use EVADC_G5_RES1.
*/
#define EVADC_G5RES1 (EVADC_G5_RES1)

/** \brief 1B08, Group 5 Result Register 2\n */
#define EVADC_G5_RES2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B08u)
/** Alias (User Manual Name) for EVADC_G5_RES2.
* To use register names with standard convension, please use EVADC_G5_RES2.
*/
#define EVADC_G5RES2 (EVADC_G5_RES2)

/** \brief 1B0C, Group 5 Result Register 3\n */
#define EVADC_G5_RES3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B0Cu)
/** Alias (User Manual Name) for EVADC_G5_RES3.
* To use register names with standard convension, please use EVADC_G5_RES3.
*/
#define EVADC_G5RES3 (EVADC_G5_RES3)

/** \brief 1B10, Group 5 Result Register 4\n */
#define EVADC_G5_RES4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B10u)
/** Alias (User Manual Name) for EVADC_G5_RES4.
* To use register names with standard convension, please use EVADC_G5_RES4.
*/
#define EVADC_G5RES4 (EVADC_G5_RES4)

/** \brief 1B14, Group 5 Result Register 5\n */
#define EVADC_G5_RES5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B14u)
/** Alias (User Manual Name) for EVADC_G5_RES5.
* To use register names with standard convension, please use EVADC_G5_RES5.
*/
#define EVADC_G5RES5 (EVADC_G5_RES5)

/** \brief 1B18, Group 5 Result Register 6\n */
#define EVADC_G5_RES6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B18u)
/** Alias (User Manual Name) for EVADC_G5_RES6.
* To use register names with standard convension, please use EVADC_G5_RES6.
*/
#define EVADC_G5RES6 (EVADC_G5_RES6)

/** \brief 1B1C, Group 5 Result Register 7\n */
#define EVADC_G5_RES7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B1Cu)
/** Alias (User Manual Name) for EVADC_G5_RES7.
* To use register names with standard convension, please use EVADC_G5_RES7.
*/
#define EVADC_G5RES7 (EVADC_G5_RES7)

/** \brief 1B20, Group 5 Result Register 8\n */
#define EVADC_G5_RES8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B20u)
/** Alias (User Manual Name) for EVADC_G5_RES8.
* To use register names with standard convension, please use EVADC_G5_RES8.
*/
#define EVADC_G5RES8 (EVADC_G5_RES8)

/** \brief 1B24, Group 5 Result Register 9\n */
#define EVADC_G5_RES9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B24u)
/** Alias (User Manual Name) for EVADC_G5_RES9.
* To use register names with standard convension, please use EVADC_G5_RES9.
*/
#define EVADC_G5RES9 (EVADC_G5_RES9)

/** \brief 1B28, Group 5 Result Register 10\n */
#define EVADC_G5_RES10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B28u)
/** Alias (User Manual Name) for EVADC_G5_RES10.
* To use register names with standard convension, please use EVADC_G5_RES10.
*/
#define EVADC_G5RES10 (EVADC_G5_RES10)

/** \brief 1B2C, Group 5 Result Register 11\n */
#define EVADC_G5_RES11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B2Cu)
/** Alias (User Manual Name) for EVADC_G5_RES11.
* To use register names with standard convension, please use EVADC_G5_RES11.
*/
#define EVADC_G5RES11 (EVADC_G5_RES11)

/** \brief 1B30, Group 5 Result Register 12\n */
#define EVADC_G5_RES12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B30u)
/** Alias (User Manual Name) for EVADC_G5_RES12.
* To use register names with standard convension, please use EVADC_G5_RES12.
*/
#define EVADC_G5RES12 (EVADC_G5_RES12)

/** \brief 1B34, Group 5 Result Register 13\n */
#define EVADC_G5_RES13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B34u)
/** Alias (User Manual Name) for EVADC_G5_RES13.
* To use register names with standard convension, please use EVADC_G5_RES13.
*/
#define EVADC_G5RES13 (EVADC_G5_RES13)

/** \brief 1B38, Group 5 Result Register 14\n */
#define EVADC_G5_RES14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021B38u)
/** Alias (User Manual Name) for EVADC_G5_RES14.
* To use register names with standard convension, please use EVADC_G5_RES14.
*/
#define EVADC_G5RES14 (EVADC_G5_RES14)

