Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEvadc_reg.h
/** \brief 1D38, Queue 1 Requ. Timer Mode Reg., Group 6 */
#define EVADC_G6_Q1_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021D38u)
/** Alias (User Manual Name) for EVADC_G6_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G6_Q1_REQTM.
*/
#define EVADC_G6REQTM1 (EVADC_G6_Q1_REQTM)

/** \brief 1D3C, Queue 1 Requ. Timer Status Reg., Group 6 */
#define EVADC_G6_Q1_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0021D3Cu)
/** Alias (User Manual Name) for EVADC_G6_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G6_Q1_REQTS.
*/
#define EVADC_G6REQTS1 (EVADC_G6_Q1_REQTS)

/** \brief 1D40, Queue 2 Source Contr. Register, Group 6 */
#define EVADC_G6_Q2_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0021D40u)
/** Alias (User Manual Name) for EVADC_G6_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G6_Q2_QCTRL.
*/
#define EVADC_G6QCTRL2 (EVADC_G6_Q2_QCTRL)

/** \brief 1D44, Queue 2 Mode Register, Group 6 */
#define EVADC_G6_Q2_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0021D44u)
/** Alias (User Manual Name) for EVADC_G6_Q2_QMR.
* To use register names with standard convension, please use EVADC_G6_Q2_QMR.
*/
#define EVADC_G6QMR2 (EVADC_G6_Q2_QMR)

/** \brief 1D48, Queue 2 Status Register, Group 6 */
#define EVADC_G6_Q2_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0021D48u)
/** Alias (User Manual Name) for EVADC_G6_Q2_QSR.
* To use register names with standard convension, please use EVADC_G6_Q2_QSR.
*/
#define EVADC_G6QSR2 (EVADC_G6_Q2_QSR)

/** \brief 1D4C, Queue 2 Register 0, Group 6 */
#define EVADC_G6_Q2_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF0021D4Cu)
/** Alias (User Manual Name) for EVADC_G6_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G6_Q2_Q0R.
*/
#define EVADC_G6Q0R2 (EVADC_G6_Q2_Q0R)

/** \brief 1D50, Queue 2 Input Register, Group 6 */
#define EVADC_G6_Q2_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0021D50u)
/** Alias (User Manual Name) for EVADC_G6_Q2_QINR.
* To use register names with standard convension, please use EVADC_G6_Q2_QINR.
*/
#define EVADC_G6QINR2 (EVADC_G6_Q2_QINR)

/** \brief 1D54, Queue 2 Backup Register, Group 6 */
#define EVADC_G6_Q2_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0021D54u)
/** Alias (User Manual Name) for EVADC_G6_Q2_QBUR.
* To use register names with standard convension, please use EVADC_G6_Q2_QBUR.
*/
#define EVADC_G6QBUR2 (EVADC_G6_Q2_QBUR)

/** \brief 1D58, Queue 2 Requ. Timer Mode Reg., Group 6 */
#define EVADC_G6_Q2_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0021D58u)
/** Alias (User Manual Name) for EVADC_G6_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G6_Q2_REQTM.
*/
#define EVADC_G6REQTM2 (EVADC_G6_Q2_REQTM)

/** \brief 1D5C, Queue 2 Requ. Timer Status Reg., Group 6 */
#define EVADC_G6_Q2_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF0021D5Cu)
/** Alias (User Manual Name) for EVADC_G6_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G6_Q2_REQTS.
*/
#define EVADC_G6REQTS2 (EVADC_G6_Q2_REQTS)

/** \brief 1D80, Channel Event Flag Register, Group 6 */
#define EVADC_G6_CEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0021D80u)
/** Alias (User Manual Name) for EVADC_G6_CEFLAG.
* To use register names with standard convension, please use EVADC_G6_CEFLAG.
*/
#define EVADC_G6CEFLAG (EVADC_G6_CEFLAG)

/** \brief 1D84, Result Event Flag Register, Group 6 */
#define EVADC_G6_REFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0021D84u)
/** Alias (User Manual Name) for EVADC_G6_REFLAG.
* To use register names with standard convension, please use EVADC_G6_REFLAG.
*/
#define EVADC_G6REFLAG (EVADC_G6_REFLAG)

/** \brief 1D88, Source Event Flag Register, Group 6 */
#define EVADC_G6_SEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0021D88u)
/** Alias (User Manual Name) for EVADC_G6_SEFLAG.
* To use register names with standard convension, please use EVADC_G6_SEFLAG.
*/
#define EVADC_G6SEFLAG (EVADC_G6_SEFLAG)

/** \brief 1D90, Channel Event Flag Clear Register, Group 6 */
#define EVADC_G6_CEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0021D90u)
/** Alias (User Manual Name) for EVADC_G6_CEFCLR.
* To use register names with standard convension, please use EVADC_G6_CEFCLR.
*/
#define EVADC_G6CEFCLR (EVADC_G6_CEFCLR)

/** \brief 1D94, Result Event Flag Clear Register, Group 6 */
#define EVADC_G6_REFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0021D94u)
/** Alias (User Manual Name) for EVADC_G6_REFCLR.
* To use register names with standard convension, please use EVADC_G6_REFCLR.
*/
#define EVADC_G6REFCLR (EVADC_G6_REFCLR)

/** \brief 1D98, Source Event Flag Clear Reg., Group 6 */
#define EVADC_G6_SEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFCLR*)0xF0021D98u)
/** Alias (User Manual Name) for EVADC_G6_SEFCLR.
* To use register names with standard convension, please use EVADC_G6_SEFCLR.
*/
#define EVADC_G6SEFCLR (EVADC_G6_SEFCLR)

/** \brief 1DA0, Channel Event Node Pointer Reg. 0, Group 6 */
#define EVADC_G6_CEVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP0*)0xF0021DA0u)
/** Alias (User Manual Name) for EVADC_G6_CEVNP0.
* To use register names with standard convension, please use EVADC_G6_CEVNP0.
*/
#define EVADC_G6CEVNP0 (EVADC_G6_CEVNP0)

/** \brief 1DA4, Channel Event Node Pointer Reg. 1, Group 6 */
#define EVADC_G6_CEVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEVNP1*)0xF0021DA4u)
/** Alias (User Manual Name) for EVADC_G6_CEVNP1.
* To use register names with standard convension, please use EVADC_G6_CEVNP1.
*/
#define EVADC_G6CEVNP1 (EVADC_G6_CEVNP1)

/** \brief 1DB0, Result Event Node Pointer Reg. 0, Group 6 */
#define EVADC_G6_REVNP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP0*)0xF0021DB0u)
/** Alias (User Manual Name) for EVADC_G6_REVNP0.
* To use register names with standard convension, please use EVADC_G6_REVNP0.
*/
#define EVADC_G6REVNP0 (EVADC_G6_REVNP0)

/** \brief 1DB4, Result Event Node Pointer Reg. 1, Group 6 */
#define EVADC_G6_REVNP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REVNP1*)0xF0021DB4u)
/** Alias (User Manual Name) for EVADC_G6_REVNP1.
* To use register names with standard convension, please use EVADC_G6_REVNP1.
*/
#define EVADC_G6REVNP1 (EVADC_G6_REVNP1)

/** \brief 1DC0, Source Event Node Pointer Reg., Group 6 */
#define EVADC_G6_SEVNP /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEVNP*)0xF0021DC0u)
/** Alias (User Manual Name) for EVADC_G6_SEVNP.
* To use register names with standard convension, please use EVADC_G6_SEVNP.
*/
#define EVADC_G6SEVNP (EVADC_G6_SEVNP)

/** \brief 1DC8, Service Request Software Activation Trigger, Group 6 */
#define EVADC_G6_SRACT /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SRACT*)0xF0021DC8u)
/** Alias (User Manual Name) for EVADC_G6_SRACT.
* To use register names with standard convension, please use EVADC_G6_SRACT.
*/
#define EVADC_G6SRACT (EVADC_G6_SRACT)

/** \brief 1DF0, External Multiplexer Control Reg., Group 6 */
#define EVADC_G6_EMUXCTR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_EMUXCTR*)0xF0021DF0u)
/** Alias (User Manual Name) for EVADC_G6_EMUXCTR.
* To use register names with standard convension, please use EVADC_G6_EMUXCTR.
*/
#define EVADC_G6EMUXCTR (EVADC_G6_EMUXCTR)

