Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEvadc_reg.h
/** \brief 22B0, Group 7 Result Control Register 12 */
#define EVADC_G7_RCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00222B0u)
/** Alias (User Manual Name) for EVADC_G7_RCR12.
* To use register names with standard convension, please use EVADC_G7_RCR12.
*/
#define EVADC_G7RCR12 (EVADC_G7_RCR12)

/** \brief 22B4, Group 7 Result Control Register 13 */
#define EVADC_G7_RCR13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00222B4u)
/** Alias (User Manual Name) for EVADC_G7_RCR13.
* To use register names with standard convension, please use EVADC_G7_RCR13.
*/
#define EVADC_G7RCR13 (EVADC_G7_RCR13)

/** \brief 22B8, Group 7 Result Control Register 14 */
#define EVADC_G7_RCR14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00222B8u)
/** Alias (User Manual Name) for EVADC_G7_RCR14.
* To use register names with standard convension, please use EVADC_G7_RCR14.
*/
#define EVADC_G7RCR14 (EVADC_G7_RCR14)

/** \brief 22BC, Group 7 Result Control Register 15 */
#define EVADC_G7_RCR15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RCR*)0xF00222BCu)
/** Alias (User Manual Name) for EVADC_G7_RCR15.
* To use register names with standard convension, please use EVADC_G7_RCR15.
*/
#define EVADC_G7RCR15 (EVADC_G7_RCR15)

/** \brief 2300, Group 7 Result Register 0\n */
#define EVADC_G7_RES0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022300u)
/** Alias (User Manual Name) for EVADC_G7_RES0.
* To use register names with standard convension, please use EVADC_G7_RES0.
*/
#define EVADC_G7RES0 (EVADC_G7_RES0)

/** \brief 2304, Group 7 Result Register 1\n */
#define EVADC_G7_RES1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022304u)
/** Alias (User Manual Name) for EVADC_G7_RES1.
* To use register names with standard convension, please use EVADC_G7_RES1.
*/
#define EVADC_G7RES1 (EVADC_G7_RES1)

/** \brief 2308, Group 7 Result Register 2\n */
#define EVADC_G7_RES2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022308u)
/** Alias (User Manual Name) for EVADC_G7_RES2.
* To use register names with standard convension, please use EVADC_G7_RES2.
*/
#define EVADC_G7RES2 (EVADC_G7_RES2)

/** \brief 230C, Group 7 Result Register 3\n */
#define EVADC_G7_RES3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF002230Cu)
/** Alias (User Manual Name) for EVADC_G7_RES3.
* To use register names with standard convension, please use EVADC_G7_RES3.
*/
#define EVADC_G7RES3 (EVADC_G7_RES3)

/** \brief 2310, Group 7 Result Register 4\n */
#define EVADC_G7_RES4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022310u)
/** Alias (User Manual Name) for EVADC_G7_RES4.
* To use register names with standard convension, please use EVADC_G7_RES4.
*/
#define EVADC_G7RES4 (EVADC_G7_RES4)

/** \brief 2314, Group 7 Result Register 5\n */
#define EVADC_G7_RES5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022314u)
/** Alias (User Manual Name) for EVADC_G7_RES5.
* To use register names with standard convension, please use EVADC_G7_RES5.
*/
#define EVADC_G7RES5 (EVADC_G7_RES5)

/** \brief 2318, Group 7 Result Register 6\n */
#define EVADC_G7_RES6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022318u)
/** Alias (User Manual Name) for EVADC_G7_RES6.
* To use register names with standard convension, please use EVADC_G7_RES6.
*/
#define EVADC_G7RES6 (EVADC_G7_RES6)

/** \brief 231C, Group 7 Result Register 7\n */
#define EVADC_G7_RES7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF002231Cu)
/** Alias (User Manual Name) for EVADC_G7_RES7.
* To use register names with standard convension, please use EVADC_G7_RES7.
*/
#define EVADC_G7RES7 (EVADC_G7_RES7)

/** \brief 2320, Group 7 Result Register 8\n */
#define EVADC_G7_RES8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022320u)
/** Alias (User Manual Name) for EVADC_G7_RES8.
* To use register names with standard convension, please use EVADC_G7_RES8.
*/
#define EVADC_G7RES8 (EVADC_G7_RES8)

/** \brief 2324, Group 7 Result Register 9\n */
#define EVADC_G7_RES9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022324u)
/** Alias (User Manual Name) for EVADC_G7_RES9.
* To use register names with standard convension, please use EVADC_G7_RES9.
*/
#define EVADC_G7RES9 (EVADC_G7_RES9)

/** \brief 2328, Group 7 Result Register 10\n */
#define EVADC_G7_RES10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022328u)
/** Alias (User Manual Name) for EVADC_G7_RES10.
* To use register names with standard convension, please use EVADC_G7_RES10.
*/
#define EVADC_G7RES10 (EVADC_G7_RES10)

/** \brief 232C, Group 7 Result Register 11\n */
#define EVADC_G7_RES11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF002232Cu)
/** Alias (User Manual Name) for EVADC_G7_RES11.
* To use register names with standard convension, please use EVADC_G7_RES11.
*/
#define EVADC_G7RES11 (EVADC_G7_RES11)

/** \brief 2330, Group 7 Result Register 12\n */
#define EVADC_G7_RES12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022330u)
/** Alias (User Manual Name) for EVADC_G7_RES12.
* To use register names with standard convension, please use EVADC_G7_RES12.
*/
#define EVADC_G7RES12 (EVADC_G7_RES12)

/** \brief 2334, Group 7 Result Register 13\n */
#define EVADC_G7_RES13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022334u)
/** Alias (User Manual Name) for EVADC_G7_RES13.
* To use register names with standard convension, please use EVADC_G7_RES13.
*/
#define EVADC_G7RES13 (EVADC_G7_RES13)

/** \brief 2338, Group 7 Result Register 14\n */
#define EVADC_G7_RES14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0022338u)
/** Alias (User Manual Name) for EVADC_G7_RES14.
* To use register names with standard convension, please use EVADC_G7_RES14.
*/
#define EVADC_G7RES14 (EVADC_G7_RES14)

/** \brief 233C, Group 7 Result Register 15\n */
#define EVADC_G7_RES15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF002233Cu)
/** Alias (User Manual Name) for EVADC_G7_RES15.
* To use register names with standard convension, please use EVADC_G7_RES15.
*/
#define EVADC_G7RES15 (EVADC_G7_RES15)

/** \brief 2380, Group 7 Result Reg. 0, Debug */
#define EVADC_G7_RESD0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022380u)
/** Alias (User Manual Name) for EVADC_G7_RESD0.
* To use register names with standard convension, please use EVADC_G7_RESD0.
*/
#define EVADC_G7RESD0 (EVADC_G7_RESD0)

/** \brief 2384, Group 7 Result Reg. 1, Debug */
#define EVADC_G7_RESD1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022384u)
/** Alias (User Manual Name) for EVADC_G7_RESD1.
* To use register names with standard convension, please use EVADC_G7_RESD1.
*/
#define EVADC_G7RESD1 (EVADC_G7_RESD1)

/** \brief 2388, Group 7 Result Reg. 2, Debug */
#define EVADC_G7_RESD2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022388u)
/** Alias (User Manual Name) for EVADC_G7_RESD2.
* To use register names with standard convension, please use EVADC_G7_RESD2.
*/
#define EVADC_G7RESD2 (EVADC_G7_RESD2)

/** \brief 238C, Group 7 Result Reg. 3, Debug */
#define EVADC_G7_RESD3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF002238Cu)
/** Alias (User Manual Name) for EVADC_G7_RESD3.
* To use register names with standard convension, please use EVADC_G7_RESD3.
*/
#define EVADC_G7RESD3 (EVADC_G7_RESD3)

/** \brief 2390, Group 7 Result Reg. 4, Debug */
#define EVADC_G7_RESD4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022390u)
/** Alias (User Manual Name) for EVADC_G7_RESD4.
* To use register names with standard convension, please use EVADC_G7_RESD4.
*/
#define EVADC_G7RESD4 (EVADC_G7_RESD4)

/** \brief 2394, Group 7 Result Reg. 5, Debug */
#define EVADC_G7_RESD5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022394u)
/** Alias (User Manual Name) for EVADC_G7_RESD5.
* To use register names with standard convension, please use EVADC_G7_RESD5.
*/
#define EVADC_G7RESD5 (EVADC_G7_RESD5)

/** \brief 2398, Group 7 Result Reg. 6, Debug */
#define EVADC_G7_RESD6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0022398u)
/** Alias (User Manual Name) for EVADC_G7_RESD6.
* To use register names with standard convension, please use EVADC_G7_RESD6.
*/
#define EVADC_G7RESD6 (EVADC_G7_RESD6)

/** \brief 239C, Group 7 Result Reg. 7, Debug */
#define EVADC_G7_RESD7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF002239Cu)
/** Alias (User Manual Name) for EVADC_G7_RESD7.
* To use register names with standard convension, please use EVADC_G7_RESD7.
*/
#define EVADC_G7RESD7 (EVADC_G7_RESD7)

/** \brief 23A0, Group 7 Result Reg. 8, Debug */
#define EVADC_G7_RESD8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00223A0u)
/** Alias (User Manual Name) for EVADC_G7_RESD8.
* To use register names with standard convension, please use EVADC_G7_RESD8.
*/
#define EVADC_G7RESD8 (EVADC_G7_RESD8)

/** \brief 23A4, Group 7 Result Reg. 9, Debug */
#define EVADC_G7_RESD9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00223A4u)
/** Alias (User Manual Name) for EVADC_G7_RESD9.
* To use register names with standard convension, please use EVADC_G7_RESD9.
*/
#define EVADC_G7RESD9 (EVADC_G7_RESD9)

/** \brief 23A8, Group 7 Result Reg. 10, Debug */
#define EVADC_G7_RESD10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00223A8u)
/** Alias (User Manual Name) for EVADC_G7_RESD10.
* To use register names with standard convension, please use EVADC_G7_RESD10.
*/
#define EVADC_G7RESD10 (EVADC_G7_RESD10)

/** \brief 23AC, Group 7 Result Reg. 11, Debug */
#define EVADC_G7_RESD11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00223ACu)
/** Alias (User Manual Name) for EVADC_G7_RESD11.
* To use register names with standard convension, please use EVADC_G7_RESD11.
*/
#define EVADC_G7RESD11 (EVADC_G7_RESD11)

